logs/fio/blk/p36003_3/4K2_srun_4K2.sh_q3_4_v2_1.log
randw-4K-n1-c1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
randw-4K-n2-c2: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n4-c4: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n8-c8: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n12-c12: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

randw-4K-n1-c1: (groupid=0, jobs=1): err= 0: pid=1096: Thu Jul 25 21:57:35 2019
  write: IOPS=39.9k, BW=156MiB/s (163MB/s)(4673MiB/30005msec)
    slat (usec): min=2, max=784, avg= 5.76, stdev= 4.78
    clat (nsec): min=1862, max=7591.7k, avg=792157.15, stdev=859928.70
     lat (usec): min=13, max=7597, avg=798.93, stdev=859.67
    clat percentiles (usec):
     | 10.000th=[  118], 20.000th=[  206], 30.000th=[  281], 40.000th=[  355],
     | 50.000th=[  420], 70.000th=[  676], 90.000th=[ 2474], 99.000th=[ 2835],
     | 99.900th=[ 5800], 99.990th=[ 7046], 99.999th=[ 7504]
   bw (  KiB/s): min=119006, max=219088, per=79.39%, avg=126605.03, stdev=12763.81, samples=59
   iops        : min=29751, max=54772, avg=31650.92, stdev=3191.00, samples=59
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=1.13%, 50=2.70%
  lat (usec)   : 100=4.49%, 250=17.53%, 500=31.97%, 750=14.70%, 1000=3.67%
  lat (msec)   : 2=8.44%, 4=15.16%, 10=0.21%
  cpu          : usr=24.68%, sys=27.87%, ctx=30011, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1196223,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n2-c2: (groupid=1, jobs=2): err= 0: pid=1101: Thu Jul 25 21:57:35 2019
  write: IOPS=40.6k, BW=159MiB/s (166MB/s)(4757MiB/30004msec)
    slat (usec): min=2, max=1082, avg= 8.50, stdev= 6.62
    clat (nsec): min=1543, max=9252.2k, avg=1561773.53, stdev=1447547.47
     lat (usec): min=14, max=9258, avg=1571.65, stdev=1447.20
    clat percentiles (usec):
     | 10.000th=[   85], 20.000th=[  169], 30.000th=[  318], 40.000th=[  824],
     | 50.000th=[ 1139], 70.000th=[ 2409], 90.000th=[ 3490], 99.000th=[ 5604],
     | 99.900th=[ 7570], 99.990th=[ 8455], 99.999th=[ 8717]
   bw (  KiB/s): min=55353, max=93136, per=39.96%, avg=64878.70, stdev=5074.12, samples=118
   iops        : min=13838, max=23284, avg=16219.28, stdev=1268.57, samples=118
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.88%, 50=4.55%
  lat (usec)   : 100=6.52%, 250=14.58%, 500=7.91%, 750=4.02%, 1000=6.38%
  lat (msec)   : 2=21.41%, 4=29.18%, 10=4.57%
  cpu          : usr=16.87%, sys=21.89%, ctx=92131, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1217879,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n4-c4: (groupid=2, jobs=4): err= 0: pid=1106: Thu Jul 25 21:57:35 2019
  write: IOPS=39.5k, BW=154MiB/s (162MB/s)(4629MiB/30006msec)
    slat (usec): min=3, max=928, avg=10.69, stdev=10.05
    clat (nsec): min=1655, max=16003k, avg=3222544.71, stdev=1695225.71
     lat (usec): min=15, max=16012, avg=3234.81, stdev=1694.56
    clat percentiles (usec):
     | 10.000th=[  979], 20.000th=[ 1647], 30.000th=[ 2089], 40.000th=[ 2802],
     | 50.000th=[ 3097], 70.000th=[ 4047], 90.000th=[ 5866], 99.000th=[ 6915],
     | 99.900th=[ 9110], 99.990th=[10552], 99.999th=[15926]
   bw (  KiB/s): min=35121, max=50637, per=24.07%, avg=38017.85, stdev=1834.85, samples=236
   iops        : min= 8780, max=12659, avg=9504.09, stdev=458.71, samples=236
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.02%, 100=0.06%, 250=0.31%
  lat (usec)   : 500=1.78%, 750=2.35%, 1000=5.97%
  lat (msec)   : 2=17.02%, 4=40.63%, 10=31.84%, 20=0.02%
  cpu          : usr=10.10%, sys=14.00%, ctx=177147, majf=0, minf=39
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1185050,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n8-c8: (groupid=3, jobs=8): err= 0: pid=1114: Thu Jul 25 21:57:35 2019
  write: IOPS=39.5k, BW=154MiB/s (162MB/s)(4627MiB/30008msec)
    slat (usec): min=3, max=15492, avg=86.48, stdev=419.10
    clat (usec): min=86, max=24815, avg=6388.55, stdev=2260.25
     lat (usec): min=102, max=30521, avg=6476.91, stdev=2291.83
    clat percentiles (usec):
     | 10.000th=[ 3818], 20.000th=[ 4490], 30.000th=[ 5080], 40.000th=[ 5866],
     | 50.000th=[ 6521], 70.000th=[ 7635], 90.000th=[ 8717], 99.000th=[13173],
     | 99.900th=[17171], 99.990th=[22414], 99.999th=[24511]
   bw (  KiB/s): min=12108, max=24102, per=9.46%, avg=14936.47, stdev=1253.46, samples=472
   iops        : min= 3027, max= 6025, avg=3733.74, stdev=313.39, samples=472
  lat (usec)   : 100=0.01%, 250=0.02%, 500=0.11%, 750=0.06%, 1000=0.16%
  lat (msec)   : 2=1.67%, 4=10.63%, 10=81.99%, 20=5.32%, 50=0.03%
  cpu          : usr=6.84%, sys=8.65%, ctx=271813, majf=0, minf=85
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1184558,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n12-c12: (groupid=4, jobs=12): err= 0: pid=1125: Thu Jul 25 21:57:35 2019
  write: IOPS=38.0k, BW=148MiB/s (156MB/s)(4455MiB/30011msec)
    slat (usec): min=3, max=11150, avg=47.95, stdev=276.02
    clat (usec): min=372, max=30302, avg=10044.06, stdev=2181.71
     lat (usec): min=399, max=30321, avg=10094.16, stdev=2196.06
    clat percentiles (usec):
     | 10.000th=[ 7963], 20.000th=[ 8160], 30.000th=[ 8717], 40.000th=[ 9110],
     | 50.000th=[ 9634], 70.000th=[11076], 90.000th=[13042], 99.000th=[16057],
     | 99.900th=[18744], 99.990th=[21365], 99.999th=[25297]
   bw (  KiB/s): min=10380, max=18208, per=8.37%, avg=12721.56, stdev=1200.08, samples=720
   iops        : min= 2595, max= 4552, avg=3180.06, stdev=300.02, samples=720
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.24%, 10=55.92%, 20=43.80%, 50=0.03%
  cpu          : usr=5.38%, sys=7.79%, ctx=464040, majf=0, minf=119
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1140485,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=156MiB/s (163MB/s), 156MiB/s-156MiB/s (163MB/s-163MB/s), io=4673MiB (4900MB), run=30005-30005msec

Run status group 1 (all jobs):
  WRITE: bw=159MiB/s (166MB/s), 159MiB/s-159MiB/s (166MB/s-166MB/s), io=4757MiB (4988MB), run=30004-30004msec

Run status group 2 (all jobs):
  WRITE: bw=154MiB/s (162MB/s), 154MiB/s-154MiB/s (162MB/s-162MB/s), io=4629MiB (4854MB), run=30006-30006msec

Run status group 3 (all jobs):
  WRITE: bw=154MiB/s (162MB/s), 154MiB/s-154MiB/s (162MB/s-162MB/s), io=4627MiB (4852MB), run=30008-30008msec

Run status group 4 (all jobs):
  WRITE: bw=148MiB/s (156MB/s), 148MiB/s-148MiB/s (156MB/s-156MB/s), io=4455MiB (4671MB), run=30011-30011msec

Disk stats (read/write):
  vda: ios=322/5914652, merge=0/0, ticks=820/23745400, in_queue=23807188, util=98.97%